In [1]:
# we use pandas builtin functions to load csv data
import pandas as pd
# df = pd.read_csv(csv_filepath)
# one way pandas allows us to work with data is using data frames

In [2]:
# for excel file we use pd.read_excel(excel_path)

In [38]:
# a data frame is comprised of rows and columns 
# when we read csv file or excel file they will be returned as dataframes
df = pd.read_csv("test.csv")
df.head(4) # this displays first 4 rows of data frames

          Name  Age  Gender      Occupation
0     John Doe   29    Male        Engineer
1   Jane Smith   34  Female  Data Scientist
2    Sam Brown   22    Male         Student
3  Emily Davis   45  Female         Teacher

In [16]:
# to access specific rows of data frame we use method .iloc[index]
df.iloc[1]

Name              Jane Smith
Age                       34
Gender                Female
Occupation    Data Scientist
Name: 1, dtype: object

In [18]:
# convert dict to data frame
x = {"name":["hema","abhi","jagan"],"price":[1200,300,900]}
y = pd.DataFrame(x)
y

    name  price
0   hema   1200
1   abhi    300
2  jagan    900

In [21]:
# convert list to data frame
x = [["hema","abhi","jagan"],[1200,300,900]]
pd.DataFrame(x)

      0     1      2
0  hema  abhi  jagan
1  1200   300    900

In [22]:
# to get specific columns from main data we use dataframe_container[[column1,column2,...]]
df[["Name"]]

          Name
0     John Doe
1   Jane Smith
2    Sam Brown
3  Emily Davis

In [26]:
# to access specific element in a row and col we use .iloc[row,col]
df.iloc[0,0]
# here iloc means index location

'John Doe'

In [28]:
# Accessing a specific element using .loc[row_index, col_label] without setting index
element = df.loc[0, 'Name']
print(element)  # Output: John Doe

element = df.loc[1, 'Age']
print(element)  # Output: 34

John Doe
34

In [33]:
# slicing in data frames
df.iloc[1:4,1:5]

   Age  Gender      Occupation
1   34  Female  Data Scientist
2   22    Male         Student
3   45  Female         Teacher

In [35]:
# slicing using labels using loc
df.loc[0:2,"Name":"Gender"]

         Name  Age  Gender
0    John Doe   29    Male
1  Jane Smith   34  Female
2   Sam Brown   22    Male